/* Are you sure you want to erase and install the selected macOS on this mac?\n\nWARNING: ALL CONTENT WILL BE ERASED! */
"areYouSureToEraseAndInstallMessageKey" = "Are you sure you want to erase and install the selected macOS on this mac?\n\nWarning: All content will be erased!";

/* Are you sure and install helper message */
"areYouSureToEraseAndInstallHelperMessageKey" = "We need to install a helper to erase and install.\n\nAre you sure you want to erase and install the selected macOS on this mac?\n\nWarning: All content will be erased!";

/* Cancel */
"cancelButtonKey" = "Cancel";

/* Header to display Title. */
"headerTitleStart" = "Erase & Install";

/* Header to display Checklist. */
"headerTitleChecklist" = "Checklist";

/* Header to display Erase is Running. */
"headerTitleEraseIsRunning" = "Preparing for Erase & Install";

/* There is an active network found key. */
"checkNetworkFoundKey" = "Active network is found";

/* The correct macOS version is not installed or the disk is not formatted in the APFS format. */
"CorrectOSorAPFSNotTrueKey" = "The correct macOS version is not installed or the disk is not formatted in the APFS format.";

/* Explanation Or Purpose of app. */
"explanationAndPurposeOfAppKey" = "This tool will erase all data on this Mac and re-install macOS to return the Mac to the factory default.\n\n All your personal data and information will be deleted from this Mac!";

/* Find My Mac Disabled */
"findMyMacDisableMessageKey" = "Find My Mac is Disabled";

/* Find My Mac is Enabled */
"findMyMacEnabledMessageKey" = "Find My Mac is Enabled, please turn it off in your iCloud account.";

/* Button Label to Install Helper */
"installHelperButtonKey" = "Install Helper";

/* Message to display when helper needs to be installed */
"messeageInstallHelperAlertKey" = "In order to proceed, we need to install an updated helper to be present on your Mac.";

/* Sorry we could not find an installer, in order to proceed, we need an installer to be present on your Mac. */
"noInstallerFoundErrorMessageKey" = "We could not find an installer, we need an installer to be present on your Mac. \n\nPlease download an installer from the Apple App Store.";

/* No Network */
"noNetworkMessageKey" = "No active network is found. \n\nPlease connect your Mac to a network.";

/* Quit */
"quitKey" = "Quit";

/* No Installer Found */
"searchProgressNoInstallerFound" = "No installer found on the local disks";

/* Select Installer Button */
"selectInstallerButtonKey" = "Select an installer";

/* Sorry */
"sorryKey" = "Sorry";

/* Warning */
"warningKey" = "Warning!";

/* Continue Button */
"continueButtonKey" = "Continue";

/* Start Erase & Install */
"startEraseAndInstallButtonKey" = "Start Erase & Install";

/* Select an Installer */
"pickerTitleKey" = "Select Installer";

/* Running Erase Commannd */
"runningEraseCommandMessageKey" = "This computer is now being erased and is locked until reboot.";

/* Alert Running on Battery Title */
"runningBatteryAlertTitleKey" = "Powersource: Internal battery";

/* Alert Running on Battery Messaage */
"runningBatteryAlertMessageKey" = "You are running on battery, you do not have enough capacity to continue\nPlease attach a powersoruce and try again.\n\n";

/* Alert Running on Battery Current battery capacity */
"runningBatteryAlertCurrentCapacityKey" = "Current capacity:";
